src/main/resources/xml/accommodationSalesServicePort/retrieveProductPurchaseData/retrieveProductPurchaseData.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:retrieveProductPurchaseData>
         <request>
            <!--Optional:-->
            <productClassName>?</productClassName>
            <!--1 or more repetitions:-->
            <useYearList>
               <startDate>?</startDate>
               <endDate>?</endDate>
            </useYearList>
            <productId>?</productId>
            <includePolicies>?</includePolicies>
            <bookDate>?</bookDate>
            <usageDate>?</usageDate>
            <numberOfUnits>?</numberOfUnits>
            <membershipId>?</membershipId>
            <ageType>?</ageType>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:retrieveProductPurchaseData>
   </soapenv:Body>
</soapenv:Envelope>